{
    "registration": {
        "description": "Chip and PIN authentication is a type of two-factor authentication (<b>possession</b> and <b>knowledge</b>). This is because the user is authenticated based on something they have (i.e., the physical card with the chip) and something they know (i.e., their PIN).",
        "advantages": {
           "Increased Security": "Chip and PIN require both something the user has (the card) and something the user knows (the PIN), making it a form of two-factor authentication. This adds an additional barrier against unauthorised access.",
           "Offline Authentication": "Chip and PIN cards can perform authentication offline, meaning they can verify the PIN without needing to connect to a central database. This can be advantageous in situations where network connectivity is limited.",
           "Speed": "Payments are quick and easy. Verifiers just need to insert their card into the reader and enter their PIN."
        },
        "disadvantages": {
            "Card Skimming Vulnerabilities": "While chip technology mitigates many forms of fraud, it doesn't eliminate the risk entirely. Criminals may still attempt to skim card details and capture PINs using sophisticated techniques, although it's more challenging than with magnetic stripe cards.",
            "Cost of Implementation": "Upgrading to Chip and PIN technology can be costly for businesses, especially small retailers who may need to invest in new card readers and systems. This initial investment can be a barrier for adoption.",
            "Pre-play Attack": "If the Unpredictable Number (UN) can be predicted, everything needed from momentary access to a chip card can be recorded to play it back and impersonate the card at a future date and location."
        },
        "notes": ["<p><b>Digital Signature</b>: A digital signature is a mathematical scheme for verifying the authenticity of digital messages or documents. A valid digital signature gives a recipient confidence that the message came from a sender known to the recipient.</p><p>Digital signatures use a Public Key Infrastructure (PKI), a standard format that provides high security and acceptance to your document. This combination of a public key and a private key is what makes a digital signature so safe.</p>",
                  "<p><b>ARQC (Authorization Request Cryptogram)</b>: ARQC is a cryptogram generated by the EMV card upon request from the point of sales terminal to obtain authorization for payment. The ARQC is forwarded across the payment network to the issuer for verification. It is derived from the issuer's Application Transaction Counter (ATC), a unique transaction counter maintained by the card's application</p><p><b>ARPC (Authorization Response Cryptogram)</b>: ARPC is a cryptogram returned by the issuer to the terminal in response to the ARQC generated by the card. After the issuer has verified the ARQC, the issuer generates an ARPC. The ARPC is sent back through the payment network to the point of sales terminal to authorise the transaction.</p>"]
    },
    "authentication": {
        "description": "<b>Authentication</b> is a process utilised to confirm the identity of a user, particularly within the framework of Chip and PIN technology. When a user interacts with a Chip and PIN system, they insert their card into a compatible terminal and enter their personal identification number (PIN). The chip then generates Authorisation Request Cryptogram (ARQC). Upon receiving the ARQC in the authorisation request, issuer system, validates the ARQC and generates response cryptogram (ARPC) using security modules like HSM.",
        "usability": {
            "Easy to Learn": "YES",
            "Infrequent Errors": "YES",
            "Scalable for Users": "Quasi-YES",
            "Easy Recovery": "NO",
            "Nothing to Carry": "NO"
        },
        "notes": ["<p><b>No PIN Attack</b>: A vulnerability in the EMV protocol that allows criminals to use stolen cards without knowing the correct PIN.</p><p>The 'No-PIN' attack uses an electronic device called 'wedge' as a 'man-in-the-middle' to prevent the PIN verification message from getting to the card, and to always respond that the PIN is correct. Thus, the terminal thinks that the PIN was entered correctly, and the card assumes that a signature was used to authenticate the transaction.</p>",
                  "<p><b>Card Shimmer</b>: A credit card shimmer is a device designed to illegally capture data stored in the microchips implanted in EMV-compliant debit and credit cards. Shimmers are very tiny, thin devices that can be fitted into a card terminal, and can read EMV microchip data much in the same way that skimmers can read magstripe data.</p>"]
    }
}