{
    "registration": {
        "description": "A security key with a fingerprint sensor is a form of two-factor authentication that combines <b>possession</b> and <b>inherence</b>. This is because the user is authenticated based on something they have (i.e., the physical security key) and something they are (i.e., their unique fingerprint). The fingerprint sensor on the security key ensures that even if the key is lost or stolen, it cannot be used without the user's unique fingerprint.",
        "advantages": {
           "Reduced Risk of Phishing": "Security keys are resistant to phishing attacks because they rely on physical possession of the key and cannot be easily duplicated. Adding fingerprint authentication further reduces the risk of unauthorised access through stolen or lost keys.",
           "Biometric Convenience": "Fingerprint authentication offers convenience for users, as they don't have to remember complex passwords or carry additional tokens. It's a quick and intuitive way to authenticate.",
           "Two-Factor Authentication (2FA)": "Combining a security key with fingerprint authentication adds an extra layer of security beyond just a password or PIN. This two-factor authentication makes it significantly harder for unauthorised users to gain access."
        },
        "disadvantages": {
            "Cost": " Implementing a security key with fingerprint authentication may involve higher costs compared to other authentication methods. This could be due to the hardware requirements for fingerprint scanners and the security key itself.",
            "Technical Complexity": "Integrating fingerprint authentication with a security key adds technical complexity to the authentication process. This complexity can lead to compatibility issues with different devices and operating systems, requiring careful implementation and maintenance.",
            "Dependency on External Services": "If the security key relies on services or hardware provided by third parties, there could be issues if these external services malfunction."  
        },
        "notes": [" <p><b>Fingerprint Template</b>: A biometric template created from the fingerprint data, is stored inside the security key and never leaves the security key because the FIDO specification requires that the fingerprint data of the user shall not leave the device. This ensures that even if the security key is lost or stolen, the fingerprint data remains secure.<p><b>Private Key</b>: The private key is a secret cryptographic key securely stored within the hardware of the security key. This key is utilised for signing data or decrypting messages, ensuring that sensitive operations can only be performed by the authorised user.</p><p><b>Public Key</b>: Asymmetrically paired with a corresponding private key, the public key is a cryptographic key utilised for verifying signatures or encrypting messages. It is openly distributed as part of the user's authentication credentials. The public key ensures that operations can be validated only by the holder of the private key, providing a robust layer of security for user interactions.</p>",
                  "<p><b>Key Handle</b>: The key handle is a reference to the private key. During the registration process, a unique private-public key pair is generated. The private key is encrypted and stored on the physical security key, while the public key is stored on the authentication server. Along with the public key, a reference to the private key, known as the key handle, is also sent to the server.</p><p>The key handle plays a vital role in linking the private key stored on the security key with the public key stored on the server, enabling secure and accurate authentication</p>"]
    },
    "authentication": {
        "description": "<b>Authentication</b> with a security key using fingerprint and challenge-response involves verifying a user's identity through a multi-step process. Initially, the user's fingerprint is authenticated by the security key, ensuring biometric confirmation of identity. Subsequently, a challenge is issued by the server, prompting the security key to generate a unique response based on the challenge and the private key stored within the key. This response is securely transmitted to the server, which verifies its authenticity using the corresponding public key associated with the user's account. This process provides a robust authentication mechanism, leveraging both biometric and cryptographic measures to ensure secure and reliable user verification.",
        "usability": {
            "Easy to Learn": "YES",
            "Infrequent Errors": "YES",
            "Scalable for Users": "YES",
            "Easy Recovery": "NO",
            "Nothing to Carry": "NO"
        },
        "notes": ["<p><b>Attestation</b>: The process in which the security key provides proof of its authenticity to the relying party (e.g., a website or service). Attestation ensures that the security key is genuine and not a malicious or counterfeit device.</p>",
                  "<p><b>Key Extraction</b>: Attackers may try to physically extract the private key stored within the security key. This could involve tampering with the hardware or exploiting vulnerabilities in the key's firmware to gain access to the cryptographic key material.</p>"]
    }
}