{
    "registration": {
        "description": "Time-based One-Time Password (TOTP) is a type of one-factor authentication based on <b>possession</b>. This is because the user is authenticated based on something they have (i.e., a device that can generate or receive the OTP, such as a smartphone with an authenticator app).",
        "advantages": {
           "Dynamic Codes": "TOTP generates unique, time-sensitive codes that expire after a short period, typically 30 seconds. This dynamic nature makes it harder for attackers to predict or reuse codes.",
           "No Connectivity Required": "TOTP does not rely on network connectivity once set up, making it suitable for environments with limited or intermittent internet access.",
           "Scalability": "TOTP is scalable and can be implemented across various platforms and services without significant overhead."
        },
        "disadvantages": {
            "Device Dependency": "TOTP requires a compatible device such as a smartphone or hardware token to generate codes. If the device is lost, stolen, or malfunctions, accessing the account becomes challenging.",
            "Single Point of Failure": "If the shared secret key used to generate TOTP codes is compromised, it can be used to generate codes indefinitely until it's changed, potentially leading to unauthorised access.",
            "Dependency on Third-party Apps": "TOTP typically requires the use of third-party authentication apps like Google Authenticator or Authy. While these apps are widely trusted, relying on third-party software introduces a dependency and potential security risks if the app itself is compromised or vulnerable to exploits."
        },
        "notes": ["<p><b>Shared Key</b>: is a secret that is known only to the client (usually a user's device) and the server. This shared key, also known as a seed, is used by both the client and the server to independently generate the One-Time Password (OTP). The OTP is a product of two parameters encrypted together: the shared secret key and the current time. This form of symmetric key cryptography ensures that the same key is used by both the client and the server.</p><p>When the user scans the QR code with an authenticator app, the shared secret key is securely transferred to the user's device. This method of transferring the shared key is generally considered secure because it leverages the existing HTTPS session to transport the secret to the user. This means the channel is end-to-end encrypted and the user's identity has been authenticated.</p>",
                  "<p><b>TOTP</b>: is an extension of the event-based HOTP algorithm, with the addition of time-based parameters T0 and TX for calculating the counter value (CT).</p><p>It's a key component of the Initiative for Open Authentication (OATH) and is used in many two-factor authentication systems. Despite its security benefits, users must be aware of potential phishing attacks due to the necessity of entering TOTP codes into an authentication page.</p>"]
    },
    "authentication": {
        "description": "<b>Authentication</b>, in the context of TOTP, is a process that validates a user's identity by prompting them to enter a unique, time-bound code. This code is generated by a TOTP (Time-Based One-Time Password) authenticator app or device, which is synchronised with a server's clock, ensuring a secure and timely verification process.",
        "usability": {
            "Easy to Learn": "YES",
            "Infrequent Errors": "YES",
            "Scalable for Users": "YES",
            "Easy Recovery": "NO",
            "Nothing to Carry": "NO"
        },
        "notes": ["<p><b>Forward-Replay Attacks</b>: An attacker with temporary access to a victim's smartphone may compute TOTPs valid at a later time. They can set future time instants on the device, collect the relevant TOTPs, and play them back later when these time instants are reached.</p>",
                  "<p><b>Phishing Attacks</b>: A real-time phishing attack where the attacker impersonates a certain service website and asks for the TOTP code, allows the attacker to grab the code and then immediately use it to log into the service on the victim's behalf.</p>"]
    }
}