{
    "facts": [
        "81% of hacking-related breaches are due to weak/stolen passwords.",
        "Studies show MFA can block nearly 99.9% of automated attacks by adding an extra layer of security.",
        "Over 50% of people reuse passwords across multiple accounts, making them vulnerable to hacks.",
        "MFA protects even compromised passwords.",
        "Companies using MFA reported an 80% increase in security incidents prevented.",
        "Over 80% of businesses are investing in MFA solutions.",
        "Over 5 billion mobile phone users globally leverage MFA, making it readily accessible.",
        "Implementing MFA can lead to significant cost savings by preventing data breaches and cyberattacks.",
        "Use MFA on all high-risk accounts, like email, banking, and social media.",
        "For maximum security, use a combination of different MFA factors.",
        "Never share your MFA codes with anyone, even if they claim to be from a trusted source.",
        "Ensure your MFA apps and devices are always up-to-date for optimal security.",
        "Encourage your friends and family to use MFA to protect their online accounts.",
        "To ensure further privacy and security protection, any data you enter here should be fictional. ",
        "Some companies are exploring even more factors like voice recognition or facial scans.",
        "Don't be a one-trick pony. Use different passwords for different account.",
        "While authenticator apps on smartphones are common, security keys and fingerprint scanners are gaining popularity.",
        "Enable MFA for all your important accounts to add an extra layer of protection.",
        "Pharaohs used scarabs as physical tokens to access tombs.",
        "Brainwave patterns as a potential future factor in MFA. Imagine logging in with your thoughts!",
        "Be extra cautious with online access on public Wi-Fi networks and consider using a portable security key.",
        "A beehive requires a specific scent and a complex dance routine for entry security.",
        "Remember, MFA can still be bypassed if you fall for phishing scams."
    ]

}